app/services/order_service.rb

  def create!
    success = true

    Order.transaction do
      @order = Order.create(user: @current_user,
                            amount_paid: amount_paid)
      build_order_items

      result = OrderItem.import(@order_items)
      raise ActiveRecord::RecordInvalid if result.failed_instances.any?

      update_products_stock
      @cart_items.destroy_all
      @shipment = Shipment.create!(user: @current_user, order: @order, payment_method: 'cash_on_delivery', customer_name: @current_user.full_name,
                                   shipping_address: 'somewhere', phone_number: '1231122')
---
INSERT INTO "orders" ("amount_paid", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["amount_paid", "100.0"], ["user_id", 2], ["created_at", "2023-04-21 15:10:10.601344"], ["updated_at", "2023-04-21 15:10:10.601344"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 1]]
INSERT INTO "shipments" ("id","customer_name","shipping_address","phone_number","payment_method","status","user_id","order_id","created_at","updated_at") VALUES (nextval('public.shipments_id_seq'),'','','',NULL,0,2,10,'2023-04-21 16:35:02.200267','2023-04-21 16:35:02.200267') RETURNING "id"

  def line_items
    @cart_items ||= CartItem.with_current_user(@current_user.id).includes(:product)
    @cart_items.map do |cart_item|
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = $1  [["user_id", 2]]
SELECT  "products".* FROM "products" WHERE "products"."id" IN (SELECT "cart_items"."product_id" FROM "cart_items" WHERE "cart_items"."user_id" = $1) LIMIT $2  [["user_id", 2], ["LIMIT", 11]]