app/helpers/cart_item_helper.rb

  def create_cart(cart_item)
    CartItem.find_or_create_by(product_id: cart_item.product_id, user_id: current_user.id).tap do |c|
      c.quantity += cart_item.quantity

      if c.quantity > c.product.quantity
        c.quantity = c.product.quantity
        flash[:alert] = "This product has only #{c.product.quantity} items in stock."
      else
        flash[:notice] = "#{cart_item.product.name} is added to cart."
      end
      c.save!
---
INSERT INTO "cart_items" ("user_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["product_id", 1], ["created_at", "2023-04-20 17:48:16.045024"], ["updated_at", "2023-04-20 17:48:16.045024"]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."product_id" = $1 AND "cart_items"."user_id" = $2 LIMIT $3  [["product_id", 1], ["user_id", 2], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = $1, "updated_at" = $2 WHERE "cart_items"."id" = $3  [["quantity", 1], ["updated_at", "2023-04-21 15:08:08.923385"], ["id", 1]]

  def add_to_session(quantity)
    session[:cart] = {} if session[:cart].nil?
    product_id = params['cart_item']['product_id']
    session[:cart][product_id] = session[:cart][product_id] ? (session[:cart][product_id] + params[:quantity].to_i) : quantity

    Product.find(product_id.to_i).tap do |p|
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]