app/controllers/cart_items_controller.rb

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."product_id" = $1 LIMIT $2  [["product_id", 0], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index
    if current_user.present?
      @cart_items = CartItem.with_current_user(current_user.id)
    else
      session[:cart] = {} if session[:cart].nil?
      @cart_items = []
      session[:cart].each do |key, value|
        @cart_items.push CartItem.new(product_id: key.to_i, quantity: value) unless Product.find_by(id: key.to_i).nil?
        session[:cart].delete(key) if Product.find_by(id: key.to_i).nil?