app/controllers/checkouts_controller.rb

  def create
    return redirect_to new_user_session_path, notice: 'Login first to checkout.' if current_user.blank?

    order_service = OrderService.new(current_user)

    if order_service.create!
---
INSERT INTO "orders" ("status", "amount_paid", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["status", 1], ["amount_paid", "100.0"], ["user_id", 2], ["created_at", "2023-04-20 21:54:10.967126"], ["updated_at", "2023-04-20 21:54:10.967126"]]