app/controllers/orders_controller.rb

  def index
    @orders = current_user.orders.includes(:shipment)
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 2]]
SELECT "shipments".* FROM "shipments" WHERE "shipments"."order_id" IN ($1, $2)  [["order_id", 1], ["order_id", 2]]

  def show
    @order = current_user.orders.includes(:shipment).find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 2], ["LIMIT", 1]]
SELECT "shipments".* FROM "shipments" WHERE "shipments"."order_id" = $1  [["order_id", 2]]