app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    @product.user = current_user

    if @product.save
---
INSERT INTO "products" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "12312312"], ["description", "12312312\r\n"], ["user_id", 2], ["created_at", "2023-04-21 16:03:30.346371"], ["updated_at", "2023-04-21 16:03:30.346371"]]

  def update
    @product.images.purge unless product_params[:images].nil?
    redirect_to @product.update(product_params) ? mine_products_path : :edit
---
UPDATE "products" SET "updated_at" = $1 WHERE "products"."id" = $2  [["updated_at", "2023-04-20 17:46:54.259211"], ["id", 1]]

  def search
    @products = Product.where('name ILIKE ?', "%#{params[:keyword]}%")
---
SELECT "products".* FROM "products" WHERE (name ILIKE '%123%')

  def mine
    @products = Product.where('user_id = ?', current_user.present? ? current_user.id : nil)
---
SELECT "products".* FROM "products" WHERE (user_id = 1)

  def find_product
    @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]