app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    @product.user = current_user

    if @product.save
---
INSERT INTO "products" ("name", "description", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Test Product"], ["description", "This is a test product"], ["price", "10.0"], ["user_id", 2], ["created_at", "2023-04-21 06:12:02.121054"], ["updated_at", "2023-04-21 06:12:02.121054"]]

  def update
    @product.images.purge unless product_params[:images].nil?
    redirect_to @product.update(product_params) ? mine_products_path : :edit
---
UPDATE "products" SET "name" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["name", "New Product Name"], ["updated_at", "2023-04-21 16:46:56.517477"], ["id", 13]]

  def destroy
    @product.images.purge
    @product.destroy && redirect_to(mine_products_path)
---
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 18]]

  def find_product
    @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]