app/controllers/shipments_controller.rb

UPDATE "shipments" SET "customer_name" = $1, "shipping_address" = $2, "phone_number" = $3, "payment_method" = $4, "status" = $5, "updated_at" = $6 WHERE "shipments"."id" = $7
---
  def update
    if @shipment.update(shipment_params.merge(status: 'completed'))

SELECT  "shipments".* FROM "shipments" WHERE "shipments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1  [["id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
  def set_shipment
    @shipment = Shipment.includes(:user, :order).find(params[:id])