app/controllers/concerns/load_cart.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "cart_items" ("user_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["product_id", 1], ["created_at", "2023-04-21 16:27:57.161825"], ["updated_at", "2023-04-21 16:27:57.161825"]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = $1 AND "cart_items"."product_id" = $2 LIMIT $3  [["user_id", 2], ["product_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def update_cart
    items = session[:cart]
    return unless items.length.positive?

    items.each do |key, value|
      Product.find_by(id: key.to_i).tap do |product|
        next if product.nil?

        if product.user.id == current_user.id
          flash[:notice] = 'You have added your item in cart before login. So, it has been removed from your cart.'
          next
        end
        CartItem.find_or_create_by(user_id: current_user.id, product_id: key.to_i).tap do |c|

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = $1  [["user_id", 2]]
SELECT COUNT(*) FROM "cart_items" WHERE "cart_items"."user_id" = $1  [["user_id", 1]]
---
  def update_session
    session[:cart] = {}
    cart_items = CartItem.with_current_user(current_user.id)
    cart_items.each { |item| session[:cart][item.product_id.to_s] = item.quantity } if cart_items.count.positive?